using System;
using System.Collections.Generic;
using System.Linq;
using System.Security.Permissions;
using System.Text;
using System.Threading.Tasks;

namespace LegistOS.Classi
{
    class ObrabotPersonalDannih
    {
        public static string textSoglObrPersDann = "СОГЛАСИЕ НА ОБРАБОТКУ ПЕРСОНАЛЬНЫХ ДАННЫХ" +
            "\r\n \r\nЯ,  " + Classi.GlobalPeremen.FIO + "," +
            "\r\nдаю LegistOS (далее – оператор) согласие на обработку своих персональных данных. " +
            "\r\n\r\nЦель обработки персональных данных:" +
            "\r\n- обеспечение соблюдения требований законодательства Российской Федерации." +
            "\r\n\r\nПеречень персональных данных, на обработку которых дается согласие:" +
            "\r\n- фамилия, имя, отчество;" +
            "\r\n- адрес электронной почты;" +
            "\r\n- номер телефона;" +
            "\r\n\r\nПеречень действий с персональными данными, на совершение которых дается согласие, общее описание используемых оператором способов обработки персональных данных:" +
            "\r\nОбработка вышеуказанных персональных данных будет осуществляться путем смешанной (автоматизированной, не автоматизированной) обработки персональных данных." +
            "\r\nСбор, запись, систематизация, хранение, уточнение (обновление, изменение), использование, блокирование, удаление, уничтожение персональных данных." +
            "\r\n\r\nОбработка вышеуказанных персональных данных будет осуществляться путем смешанной обработки персональных данных. " +
            "\r\n\r\nСрок, в течение которого действует согласие субъекта персональных данных, а также способ его отзыва, если иное не установлено федеральным законом;" +
            "\r\n\r\nНастоящее согласие на обработку персональных данных действует с момента его представления оператору на период пользования приложением LegistOS и может " +
            "быть отозвано мной в любое время путем подачи оператору заявления в простой письменной или электронной форме." +
            "\r\nПерсональные данные субъекта подлежат хранению в течение сроков, установленных законодательством Российской Федерации. " +
            "Персональные данные уничтожаются: по достижению целей обработки персональных данных; при ликвидации или реорганизации оператора; на основании письменного " +
            "обращения субъекта персональных данных с требованием о прекращении обработки его персональных данных (оператор прекратит обработку таких персональных данных в " +
            "течение 3 (трех) рабочих дней, о чем будет направлено письменное уведомление субъекту персональных данных в течение 10 (десяти) рабочих дней." +
            "\r\n\r\n\r\n____________________________________   /______________/                                                                 «__» ________ 2023 г.\r\n";
    }
}
